Repository: Flotapponnier/Boba_Talkie
Catalog: priv/gettext/*/LC_MESSAGES/default.po
Languages: ar, fr, it, ru

source: Choose Your Learning Adventure
ar: اختر مغامرتك التعليمية
fr: Choisissez votre aventure d'apprentissage
it: Scegli la Tua Avventura di Apprendimento
ru: Выберите свое обучающее приключение

source: Select a topic to start your voice-controlled journey
ar: حدد موضوعًا لبدء رحلتك المتحكم بها بالصوت
fr: Sélectionnez un sujet pour commencer votre parcours vocal
it: Seleziona un argomento per iniziare il tuo viaggio controllato dalla voce
ru: Выберите тему, чтобы начать ваше голосовое путешествие

source: Back to Home
ar: عد إلى الرئيسية
fr: Retour à l'accueil
it: Torna a Casa
ru: Назад на главную

source: Learn
ar: تعلّم
fr: Apprendre
it: Impara
ru: Обучение

source: Play
ar: العب
fr: Jouer
it: Gioca
ru: Игра

source: Interface Language
ar: لغة الواجهة
fr: Langue de l'interface
it: Lingua dell'Interfaccia
ru: Язык интерфейса

source: Learning Language
ar: لغة التعلم
fr: Langue d'apprentissage
it: Lingua da Imparare
ru: Изучаемый язык

source: Select the language you want to learn
ar: اختر اللغة التي تريد تعلمها
fr: Sélectionnez la langue que vous voulez apprendre
it: Seleziona la lingua che vuoi imparare
ru: Выберите язык, который хотите изучить

source: Quick Commands:
ar: أوامر سريعة:
fr: Commandes rapides :
it: Comandi Rapidi:
ru: Быстрые команды:

source: Stats
ar: إحصائيات
fr: Statistiques
it: Statistiche
ru: Статистика

source: Commands:
ar: أوامر:
fr: Commandes :
it: Comandi:
ru: Команды:

source: Score:
ar: النتيجة:
it: Punteggio:
ru: Очки:

source: Messages
ar: رسائل
it: Messaggi
ru: Сообщения

source: Voice Recognition Ready
ar: تمييز الصوت جاهز
fr: Reconnaissance vocale prête
it: Riconoscimento Vocale Pronto
ru: Распознавание голоса готово

source: Listening...
ar: أستمع...
fr: En écoute...
it: In ascolto...
ru: Слушаю...

source: Speak a command...
ar: انطق أمرًا...
fr: Dites une commande...
it: Pronuncia un comando...
ru: Произнесите команду...

source: Last:
ar: الأخير:
fr: Dernier :
it: Ultimo:
ru: Последнее:

source: Recording... (Release to stop)
ar: تسجيل... (اترك للإيقاف)
fr: Enregistrement... (Relâchez pour arrêter)
it: Registrando... (Rilascia per fermare)
ru: Запись... (Отпустите, чтобы остановить)

source: Hold to Speak (or R)
ar: اضغط للتحدث (أو R)
fr: Maintenez pour parler (ou R)
it: Tieni premuto per parlare (o R)
ru: Удерживайте для речи (или R)

source: Challenges
ar: تحديات
fr: Défis
it: Sfide
ru: Вызовы

source: Select a card!
ar: اختر بطاقة!
fr: Sélectionnez une carte !
it: Seleziona una carta!
ru: Выберите карточку!

source: Tutorial
ar: درس تعليمي
fr: Tutoriel
ru: Учебник

source: Vocabulary
ar: مفردات
fr: Vocabulaire
it: Vocabolario
ru: Словарь

source: Practice saying each word
ar: تدرّب على نطق كل كلمة
fr: Entraînez-vous à dire chaque mot
it: Pratica pronunciando ogni parola
ru: Потренируйтесь произносить каждое слово

source: Continue to Game
ar: متابعة إلى اللعبة
fr: Continuer vers le jeu
it: Continua al Gioco
ru: Продолжить игру

source: Skip Tutorial
ar: تخطي الدرس التعليمي
fr: Passer le tutoriel
it: Salta Tutorial
ru: Пропустить учебник

source: Congratulations!
ar: تهانينا!
fr: Félicitations !
it: Congratulazioni!
ru: Поздравляем!

source: You completed all
ar: لقد أكملت جميع
fr: Vous avez terminé toutes les
it: Hai completato tutte
ru: Вы выполнили все

source: cards! Your pronunciation score:
ar: البطاقات! نتيجة نطقك:
fr: cartes ! Votre score de prononciation :
it: le carte! Il tuo punteggio di pronuncia:
ru: карточки! Ваш балл за произношение:

source: Play Again
ar: العب مرة أخرى
fr: Rejouer
it: Gioca Ancora
ru: Играть снова

source: Invalid selection
ar: اختيار غير صحيح
fr: Sélection invalide
it: Selezione non valida
ru: Неправильный выбор

source: Microphone not available
ar: الميكروفون غير متاح
fr: Microphone non disponible
it: Microfono non disponibile
ru: Микрофон недоступен

source: Learn basic phrases to introduce yourself
ar: تعلّم عبارات أساسية لتقديم نفسك
fr: Apprenez les phrases de base pour vous présenter
it: Impara frasi di base per presentarti
ru: Освойте базовые фразы для представления

source: Discover fruits and food vocabulary
ar: اكتشف مفردات الفواكه والطعام
fr: Découvrez le vocabulaire des fruits et de la nourriture
it: Scopri il vocabolario di frutta e cibo
ru: Изучите словарь фруктов и продуктов

source: Practice counting and number vocabulary
ar: تدرّب على العد ومفردات الأرقام
fr: Pratiquez le comptage et le vocabulaire des nombres
it: Pratica il conteggio e il vocabolario dei numeri
ru: Потренируйте счёт и числовую лексику

source: Learn colors and color descriptions
ar: تعلّم الألوان وأوصاف الألوان
fr: Apprenez les couleurs et leurs descriptions
it: Impara i colori e le descrizioni dei colori
ru: Освойте цвета и описания цветов

source: Learn bakery items and ordering phrases
ar: تعلّم منتجات المخبز وعبارات الطلب
fr: Apprenez les articles de boulangerie et les phrases de commande
it: Impara gli articoli da forno e le frasi per ordinare
ru: Освойте товары пекарни и фразы для заказа

source: Discover animal vocabulary and descriptions
ar: اكتشف مفردات الحيوانات والأوصاف
fr: Découvrez le vocabulaire des animaux et leurs descriptions
it: Scopri il vocabolario degli animali e le descrizioni
ru: Изучите словарь животных и описания

source: Practice ordering food and restaurant phrases
ar: تدرّب على طلب الطعام وعبارات المطعم
fr: Pratiquez les commandes de nourriture et les phrases de restaurant
it: Pratica ordinando cibo e frasi da ristorante
ru: Потренируйте заказ еды и ресторанные фразы

source: Learn family relationships and descriptions
ar: تعلّم علاقات العائلة والأوصاف
fr: Apprenez les relations familiales et leurs descriptions
it: Impara i rapporti familiari e le descrizioni
ru: Освойте семейные отношения и описания

source: Explore countries, nationalities, and cultures
ar: استكشف البلدان والجنسيات والثقافات
fr: Explorez les pays, nationalités et cultures
it: Esplora paesi, nazionalità e culture
ru: Исследуйте страны, национальности и культуры

source: Learn languages through voice-controlled gaming
ar: تعلّم اللغات من خلال الألعاب المتحكم بها بالصوت
fr: Apprenez les langues grâce aux jeux contrôlés par la voix
it: Impara le lingue attraverso giochi controllati dalla voce
ru: Изучайте языки через голосовые игры

source: How it works
ar: كيف يعمل
fr: Comment ça fonctionne
it: Come funziona
ru: Как это работает

source: Actions
ar: إجراءات
it: Azioni
ru: Действия

source: Attempting to reconnect
ar: محاولة إعادة الاتصال
it: Tentativo di riconnessione
ru: Попытка переподключения

source: Something went wrong!
ar: حدث خطأ ما!
it: Qualcosa è andato storto!
ru: Что-то пошло не так!

source: We can't find the internet
ar: لا يمكننا العثور على الإنترنت
it: Non riusciamo a trovare internet
ru: Мы не можем найти интернет

source: close
ar: إغلاق
it: chiudi
ru: закрыть

source: Built with Phoenix LiveView • Real-time voice recognition
ar: بني باستخدام Phoenix LiveView • تمييز صوتي في الوقت الفعلي
fr: Construit avec Phoenix LiveView • Reconnaissance vocale en temps réel
it: Costruito con Phoenix LiveView • Riconoscimento vocale in tempo reale
ru: Создано с помощью Phoenix LiveView • Распознавание голоса в реальном времени

source: Get real-time pronunciation feedback
ar: احصل على تغذية راجعة عن النطق في الوقت الفعلي
fr: Obtenez des commentaires de prononciation en temps réel
it: Ottieni feedback di pronuncia in tempo reale
ru: Получайте обратную связь по произношению в реальном времени

source: Learn & Improve
ar: تعلّم وتحسّن
fr: Apprendre et Améliorer
it: Imparare e Migliorare
ru: Учиться и Улучшаться

source: Move through a 2D grid world
ar: انتقل عبر عالم شبكي ثنائي الأبعاد
fr: Déplacez-vous dans un monde en grille 2D
it: Muoviti attraverso un mondo a griglia 2D
ru: Перемещайтесь по 2D сетчатому миру

source: Movement
ar: حركة
fr: Mouvement
it: Movimento
ru: Движение

source: Navigate World
ar: انتقل في العالم
fr: Naviguer dans le Monde
it: Naviga nel Mondo
ru: Навигация по Миру

source: Ready to Start Learning?
ar: هل أنت مستعد لبدء التعليم؟
fr: Prêt à Commencer l'Apprentissage ?
it: Pronto per Iniziare ad Imparare?
ru: Готовы Начать Обучение?

source: Select Map & Play
ar: اختر الخريطة والعب
fr: Sélectionner Carte et Jouer
it: Seleziona Mappa e Gioca
ru: Выбрать Карту и Играть

source: Speak Commands
ar: أوامر صوتية
fr: Parler Commandes
it: Comandi Vocali
ru: Голосовые Команды

source: Use your voice to control your character
ar: استخدم صوتك للتحكم في شخصيتك
fr: Utilisez votre voix pour contrôler votre personnage
it: Usa la tua voce per controllare il tuo personaggio
ru: Используйте голос для управления персонажем

source: Voice Commands You'll Use
ar: الأوامر الصوتية التي ستستخدمها
fr: Commandes Vocales que Vous Utiliserez
it: Comandi Vocali che Userai
ru: Голосовые Команды, Которые Вы Будете Использовать

source: go north
ar: اذهب شمالاً
fr: aller au nord
it: vai a nord
ru: идти на север

source: help
ar: مساعدة
fr: aide
it: aiuto
ru: помощь

source: look around
ar: انظر حولك
fr: regarder autour
it: guarda intorno
ru: осмотреться

source: move east
ar: تحرّك شرقاً
fr: aller à l'est
it: muovi a est
ru: двигаться на восток

source: pick up item
ar: التقط عنصراً
fr: prendre objet
it: raccogli oggetto
ru: поднять предмет

source: turn around
ar: استدر
fr: se retourner
it: girati
ru: повернуться

source: Level:
ar: المستوى:
fr: Niveau :
it: Livello:
ru: Уровень:

source: Words:
ar: كلمات:
fr: Mots :
it: Parole:
ru: Слова:

source: Back to Maps
ar: العودة إلى الخرائط
fr: Retour aux Cartes
it: Torna alle Mappe
ru: Назад к картам

source: Example Usage
ar: مثال الاستخدام
fr: Exemple d'utilisation
it: Esempio d'uso
ru: Пример использования

source: Hide Pronunciation
ar: إخفاء النطق
fr: Cacher la prononciation
it: Nascondi pronuncia
ru: Скрыть произношение

source: Language I want to learn:
ar: اللغة التي أريد تعلمها:
fr: Langue que je veux apprendre :
it: Lingua che voglio imparare:
ru: Язык, который я хочу изучать:

source: Next
ar: التالي
fr: Suivant
it: Avanti
ru: Далее

source: Practice saying each word out loud to improve your pronunciation!
ar: مارس قول كل كلمة بصوت عالٍ لتحسين نطقك!
fr: Entraînez-vous à dire chaque mot à haute voix pour améliorer votre prononciation!
it: Pratica dicendo ogni parola ad alta voce per migliorare la tua pronuncia!
ru: Практикуйтесь произносить каждое слово вслух, чтобы улучшить произношение!

source: Previous
ar: السابق
fr: Précédent
it: Indietro
ru: Назад

source: Progress
ar: التقدم
fr: Progrès
it: Progresso
ru: Прогресс

source: Romanization
ar: النقل بالحروف اللاتينية
fr: Romanisation
it: Romanizzazione
ru: Романизация

source: Show Pronunciation
ar: إظهار النطق
fr: Afficher la prononciation
it: Mostra pronuncia
ru: Показать произношение

source: Start Playing
ar: بدء اللعب
fr: Commencer à jouer
it: Inizia a giocare
ru: Начать игру

source: Tip
ar: نصيحة
fr: Conseil
it: Suggerimento
ru: Совет

source: Animals
ar: حيوانات
fr: Animaux
it: Animali
ru: Животные

source: Bakery
ar: مخبز
fr: Boulangerie
it: Panetteria
ru: Пекарня

source: Colors
ar: ألوان
fr: Couleurs
it: Colori
ru: Цвета

source: Countries
ar: بلدان
fr: Pays
it: Paesi
ru: Страны

source: Explore vibrant colors and color descriptions
ar: استكشف الألوان الزاهية وأوصاف الألوان
fr: Explorez les couleurs vives et leurs descriptions
it: Esplora colori vivaci e descrizioni dei colori
ru: Исследуйте яркие цвета и их описания

source: Family
ar: عائلة
fr: Famille
it: Famiglia
ru: Семья

source: Fruits & Food
ar: فواكه وطعام
fr: Fruits et Nourriture
it: Frutta e Cibo
ru: Фрукты и Еда

source: Learn essential bakery vocabulary and ordering phrases
ar: تعلّم مفردات المخبز الأساسية وعبارات الطلب
fr: Apprenez le vocabulaire essentiel de boulangerie et les phrases de commande
it: Impara il vocabolario essenziale della panetteria e le frasi per ordinare
ru: Освойте основной словарь пекарни и фразы для заказа

source: Master restaurant vocabulary and ordering phrases
ar: أتقن مفردات المطعم وعبارات الطلب
fr: Maîtrisez le vocabulaire de restaurant et les phrases de commande
it: Padroneggia il vocabolario del ristorante e le frasi per ordinare
ru: Овладейте ресторанным словарем и фразами для заказа

source: Numbers
ar: أرقام
fr: Nombres
it: Numeri
ru: Числа

source: Restaurant
ar: مطعم
it: Ristorante
ru: Ресторан

source: Self-Introduction
ar: تقديم الذات
fr: Présentation de Soi
it: Autopresentazione
ru: Самопредставление

source: ACTIVE
ar: نشط
it: ATTIVO

source: Trophy
ar: جائزة
it: Trofeo
